{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "signature": {"outputs": {"ArgMax": {"name": "ArgMax"}}}, "modelTopology": {"node": [{"name": "resnet_model/batch_normalization_45/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "944"}]}}}}}, {"name": "resnet_model/batch_normalization_45/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "944"}]}}}}}, {"name": "resnet_model/batch_normalization_45/moving_mean", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "944"}]}}}}}, {"name": "resnet_model/batch_normalization_45/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "944"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/conv2d_51/EConv2D_1/Variable", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "284"}, {"size": "1"}]}}}}}, {"name": "resnet_model/conv2d_52/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "288"}, {"size": "944"}]}}}}}, {"name": "resnet_model/batch_normalization_42/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "944"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/batch_normalization_42/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "944"}]}}}}}, {"name": "resnet_model/batch_normalization_42/moving_mean", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "944"}]}}}}}, {"name": "resnet_model/batch_normalization_42/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "944"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/conv2d_48/EConv2D_1/Variable", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "280"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/conv2d_49/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "284"}, {"size": "944"}]}}}}}, {"name": "resnet_model/conv2d_44/SelfAttention_1/Reshape/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_44/SelfAttention_1/Reshape/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_44/SelfAttention_1/Reshape/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_44/SelfAttention_1/Reshape/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_44/SelfAttention_1/Reshape/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_44/SelfAttention_1/BroadcastTo/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_44/SelfAttention_1/BroadcastTo/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_44/SelfAttention_1/BroadcastTo/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_44/SelfAttention_1/BroadcastTo/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_44/SelfAttention_1/BroadcastTo/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_44/SelfAttention_1/Variable", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "528"}, {"size": "328"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/conv2d_44/SelfAttention_1/strided_slice/stack", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_44/SelfAttention_1/strided_slice/stack_1", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_44/SelfAttention_1/strided_slice/stack_2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "resnet_model/conv2d_44/SelfAttention_1/Reshape_1/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_44/SelfAttention_1/Reshape_1/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_44/SelfAttention_1/Reshape_1/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/batch_normalization_40/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "328"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/batch_normalization_40/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "328"}]}}}}}, {"name": "resnet_model/batch_normalization_40/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "328"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/batch_normalization_40/moving_variance", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "328"}]}}}}}, {"name": "resnet_model/Pad_6/paddings", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}}}, {"name": "resnet_model/conv2d_45/EConv2D_1/Variable", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "328"}, {"size": "1"}]}}}}}, {"name": "resnet_model/conv2d_46/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "288"}, {"size": "944"}]}}}}}, {"name": "resnet_model/conv2d_43/SelfAttention_1/Reshape/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_43/SelfAttention_1/Reshape/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_43/SelfAttention_1/Reshape/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_43/SelfAttention_1/Reshape/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_43/SelfAttention_1/Reshape/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_43/SelfAttention_1/BroadcastTo/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_43/SelfAttention_1/BroadcastTo/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_43/SelfAttention_1/BroadcastTo/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_43/SelfAttention_1/BroadcastTo/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_43/SelfAttention_1/BroadcastTo/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_42/SelfAttention_1/Reshape/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_42/SelfAttention_1/Reshape/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_42/SelfAttention_1/Reshape/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_42/SelfAttention_1/Reshape/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_42/SelfAttention_1/Reshape/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_42/SelfAttention_1/BroadcastTo/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_42/SelfAttention_1/BroadcastTo/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_42/SelfAttention_1/BroadcastTo/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_42/SelfAttention_1/BroadcastTo/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_42/SelfAttention_1/BroadcastTo/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_41/SelfAttention_1/Reshape/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_41/SelfAttention_1/Reshape/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_41/SelfAttention_1/Reshape/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_41/SelfAttention_1/Reshape/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_41/SelfAttention_1/Reshape/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_41/SelfAttention_1/BroadcastTo/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_41/SelfAttention_1/BroadcastTo/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_41/SelfAttention_1/BroadcastTo/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_41/SelfAttention_1/BroadcastTo/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_41/SelfAttention_1/BroadcastTo/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_40/SelfAttention_1/Reshape/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_40/SelfAttention_1/Reshape/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_40/SelfAttention_1/Reshape/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_40/SelfAttention_1/Reshape/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_40/SelfAttention_1/Reshape/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_40/SelfAttention_1/BroadcastTo/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_40/SelfAttention_1/BroadcastTo/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_40/SelfAttention_1/BroadcastTo/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_40/SelfAttention_1/BroadcastTo/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_40/SelfAttention_1/BroadcastTo/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/batch_normalization_36/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "528"}]}}}}}, {"name": "resnet_model/batch_normalization_36/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "528"}]}}}}}, {"name": "resnet_model/batch_normalization_36/moving_mean", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "528"}]}}}}}, {"name": "resnet_model/batch_normalization_36/moving_variance", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "528"}]}}}}}, {"name": "resnet_model/conv2d_40/SelfAttention_1/Variable", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "528"}, {"size": "168"}]}}}}}, {"name": "resnet_model/conv2d_40/SelfAttention_1/strided_slice/stack", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "resnet_model/conv2d_40/SelfAttention_1/strided_slice/stack_1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "resnet_model/conv2d_40/SelfAttention_1/strided_slice/stack_2", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_40/SelfAttention_1/Reshape_1/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_40/SelfAttention_1/Reshape_1/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_40/SelfAttention_1/Reshape_1/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/batch_normalization_37/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "168"}]}}}}}, {"name": "resnet_model/batch_normalization_37/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "168"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/batch_normalization_37/moving_mean", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "168"}]}}}}}, {"name": "resnet_model/batch_normalization_37/moving_variance", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "168"}]}}}}}, {"name": "resnet_model/conv2d_41/SelfAttention_1/EConv2D_1/Variable", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "168"}, {"size": "2"}]}}}}}, {"name": "resnet_model/conv2d_41/SelfAttention_1/EConv2D_1/Variable_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "336"}, {"size": "168"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/conv2d_41/SelfAttention_1/strided_slice/stack", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "resnet_model/conv2d_41/SelfAttention_1/strided_slice/stack_1", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_41/SelfAttention_1/strided_slice/stack_2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "resnet_model/conv2d_41/SelfAttention_1/Reshape_1/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_41/SelfAttention_1/Reshape_1/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_41/SelfAttention_1/Reshape_1/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/batch_normalization_38/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "168"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/batch_normalization_38/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "168"}]}}}}}, {"name": "resnet_model/batch_normalization_38/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "168"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/batch_normalization_38/moving_variance", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "168"}]}}}}}, {"name": "resnet_model/conv2d_42/SelfAttention_1/Variable", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "168"}, {"size": "528"}]}}}}}, {"name": "resnet_model/conv2d_42/SelfAttention_1/strided_slice/stack", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "resnet_model/conv2d_42/SelfAttention_1/strided_slice/stack_1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "resnet_model/conv2d_42/SelfAttention_1/strided_slice/stack_2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "resnet_model/conv2d_42/SelfAttention_1/Reshape_1/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_42/SelfAttention_1/Reshape_1/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_42/SelfAttention_1/Reshape_1/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_39/SelfAttention_1/Reshape/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_39/SelfAttention_1/Reshape/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_39/SelfAttention_1/Reshape/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_39/SelfAttention_1/Reshape/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_39/SelfAttention_1/Reshape/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_39/SelfAttention_1/BroadcastTo/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_39/SelfAttention_1/BroadcastTo/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_39/SelfAttention_1/BroadcastTo/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_39/SelfAttention_1/BroadcastTo/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_39/SelfAttention_1/BroadcastTo/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_38/SelfAttention_1/Reshape/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_38/SelfAttention_1/Reshape/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_38/SelfAttention_1/Reshape/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_38/SelfAttention_1/Reshape/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_38/SelfAttention_1/Reshape/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_38/SelfAttention_1/BroadcastTo/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_38/SelfAttention_1/BroadcastTo/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_38/SelfAttention_1/BroadcastTo/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_38/SelfAttention_1/BroadcastTo/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_38/SelfAttention_1/BroadcastTo/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_37/SelfAttention_1/Reshape/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_37/SelfAttention_1/Reshape/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_37/SelfAttention_1/Reshape/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_37/SelfAttention_1/Reshape/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_37/SelfAttention_1/Reshape/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_37/SelfAttention_1/BroadcastTo/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_37/SelfAttention_1/BroadcastTo/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_37/SelfAttention_1/BroadcastTo/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_37/SelfAttention_1/BroadcastTo/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_37/SelfAttention_1/BroadcastTo/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/batch_normalization_33/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "528"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/batch_normalization_33/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "528"}]}}}}}, {"name": "resnet_model/batch_normalization_33/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "528"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/batch_normalization_33/moving_variance", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "528"}]}}}}}, {"name": "resnet_model/conv2d_37/SelfAttention_1/Variable", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "528"}, {"size": "168"}]}}}}}, {"name": "resnet_model/conv2d_37/SelfAttention_1/strided_slice/stack", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "resnet_model/conv2d_37/SelfAttention_1/strided_slice/stack_1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "resnet_model/conv2d_37/SelfAttention_1/strided_slice/stack_2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "resnet_model/conv2d_37/SelfAttention_1/Reshape_1/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_37/SelfAttention_1/Reshape_1/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_37/SelfAttention_1/Reshape_1/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/batch_normalization_34/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "168"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/batch_normalization_34/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "168"}]}}}}}, {"name": "resnet_model/batch_normalization_34/moving_mean", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "168"}]}}}}}, {"name": "resnet_model/batch_normalization_34/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "168"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/conv2d_38/SelfAttention_1/EConv2D_1/Variable", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "168"}, {"size": "2"}]}}}}}, {"name": "resnet_model/conv2d_38/SelfAttention_1/EConv2D_1/Variable_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "336"}, {"size": "172"}]}}}}}, {"name": "resnet_model/conv2d_38/SelfAttention_1/strided_slice/stack", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "resnet_model/conv2d_38/SelfAttention_1/strided_slice/stack_1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "resnet_model/conv2d_38/SelfAttention_1/strided_slice/stack_2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "resnet_model/conv2d_38/SelfAttention_1/Reshape_1/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_38/SelfAttention_1/Reshape_1/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_38/SelfAttention_1/Reshape_1/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/batch_normalization_35/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "172"}]}}}}}, {"name": "resnet_model/batch_normalization_35/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "172"}]}}}}}, {"name": "resnet_model/batch_normalization_35/moving_mean", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "172"}]}}}}}, {"name": "resnet_model/batch_normalization_35/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "172"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/conv2d_39/SelfAttention_1/Variable", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "172"}, {"size": "528"}]}}}}}, {"name": "resnet_model/conv2d_39/SelfAttention_1/strided_slice/stack", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_39/SelfAttention_1/strided_slice/stack_1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "resnet_model/conv2d_39/SelfAttention_1/strided_slice/stack_2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "resnet_model/conv2d_39/SelfAttention_1/Reshape_1/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_39/SelfAttention_1/Reshape_1/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_39/SelfAttention_1/Reshape_1/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_36/SelfAttention_1/Reshape/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_36/SelfAttention_1/Reshape/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_36/SelfAttention_1/Reshape/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_36/SelfAttention_1/Reshape/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_36/SelfAttention_1/Reshape/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_36/SelfAttention_1/BroadcastTo/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_36/SelfAttention_1/BroadcastTo/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_36/SelfAttention_1/BroadcastTo/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_36/SelfAttention_1/BroadcastTo/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_36/SelfAttention_1/BroadcastTo/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_35/SelfAttention_1/Reshape/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_35/SelfAttention_1/Reshape/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_35/SelfAttention_1/Reshape/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_35/SelfAttention_1/Reshape/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_35/SelfAttention_1/Reshape/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_35/SelfAttention_1/BroadcastTo/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_35/SelfAttention_1/BroadcastTo/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_35/SelfAttention_1/BroadcastTo/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_35/SelfAttention_1/BroadcastTo/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_35/SelfAttention_1/BroadcastTo/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_34/SelfAttention_1/Reshape/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_34/SelfAttention_1/Reshape/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_34/SelfAttention_1/Reshape/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_34/SelfAttention_1/Reshape/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_34/SelfAttention_1/Reshape/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_34/SelfAttention_1/BroadcastTo/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_34/SelfAttention_1/BroadcastTo/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_34/SelfAttention_1/BroadcastTo/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_34/SelfAttention_1/BroadcastTo/shape/4", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_34/SelfAttention_1/BroadcastTo/shape/5", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/batch_normalization_30/gamma", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "528"}]}}}}}, {"name": "resnet_model/batch_normalization_30/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "528"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/batch_normalization_30/moving_mean", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "528"}]}}}}}, {"name": "resnet_model/batch_normalization_30/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "528"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/conv2d_34/SelfAttention_1/Variable", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "528"}, {"size": "168"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/conv2d_34/SelfAttention_1/strided_slice/stack", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "resnet_model/conv2d_34/SelfAttention_1/strided_slice/stack_1", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_34/SelfAttention_1/strided_slice/stack_2", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_34/SelfAttention_1/Reshape_1/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_34/SelfAttention_1/Reshape_1/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_34/SelfAttention_1/Reshape_1/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/batch_normalization_31/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "168"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/batch_normalization_31/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "168"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/batch_normalization_31/moving_mean", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "168"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/batch_normalization_31/moving_variance", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "168"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/conv2d_35/SelfAttention_1/EConv2D_1/Variable", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "168"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/conv2d_35/SelfAttention_1/EConv2D_1/Variable_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "336"}, {"size": "168"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "resnet_model/conv2d_35/SelfAttention_1/strided_slice/stack", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "resnet_model/conv2d_35/SelfAttention_1/strided_slice/stack_1", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_35/SelfAttention_1/strided_slice/stack_2", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/conv2d_35/SelfAttention_1/Reshape_1/shape/1", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_35/SelfAttention_1/Reshape_1/shape/2", "op": "Const", "device": "/device:GPU:0", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "resnet_model/conv2d_35/SelfAttention_1/Reshape_1/shape/3", "op": "Const", "device": "/device:GPU:0", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "resnet_model/batch_normalization_32/gamma", "op": "Const", "attr": {"dtype": {"type": 